{ "phrases": [
	{
		"title": "1. Настройка диалога",
		"imagePath": "https://fakem1ner.github.io/diagen-dependecies/img/diagen1.png",
		"description": "Первым шагом, необходимо настроить диалог. Это очень важно, ведь от этого зависит, как он будет отображаться в игре. В соответствующих полях укажите название латиницей (рекомендуется использовать имя персонажа и номер диалога с 0), цвет имени в формате hex и название датапака, в который будет помещен диалог"
	},
	{
		"title": "2. Создание реплик",
		"imagePath": "https://fakem1ner.github.io/diagen-dependecies/img/diagen2.png",
		"description": "На первой реплике вы увидите две кнопки - красную и желтую. Красная поможет удалить реплику, а желтая - создать под ней новую. В нее вы можете добавить имя персонажа и его реплику. В игре они будут переключатся кнопкой в чате. <br> [fb24m] Это отличный инструмент! <br> > <br> [fb25m] Да, он очень поможет! (появится при нажатии на > в чате)"
	},
	{
		"title": "3. Добавление ответов",
		"imagePath": "https://fakem1ner.github.io/diagen-dependecies/img/diagen3.png",
		"description": "В поле \"Ответ\", вы можете выбрать \"Ответ\", а в поле ниже ввести сам ответ, при котором будет активироваться следующая реплика. <br> [fb24m] Это отличный инструмент! <br> > Я согласен! <br> [fb25m] Да, он очень поможет! (появится при нажатии на > в чате)"
	},
	{
		"title": "4. Выполнение команд",
		"imagePath": "https://fakem1ner.github.io/diagen-dependecies/img/diagen4.png",
		"description": "В поле \"Ответ\", вы можете выбрать \"Команда\", а в поле ниже ввести саму команду. Тогда, после реплики в которой она указана, выполнится команда, а затем выполнится переход к следующей реплике <br> [fb24m] Это отличный инструмент! <br> (выполнится команда summon minecraft:creeper) <br> [fb25m] Да, он очень поможет! (появится после выполнения команды)"
	},
	{
		"title": "5. Переход к другим диалогам",
		"imagePath": "https://fakem1ner.github.io/diagen-dependecies/img/diagen5.png",
		"description": "В конце, вы можете добавить выбор перехода к другим диалогам, и в зависимости от выбора будет выполняться переход к другим диалогам. В примере на картинке, необходимо создать диалоги fb24m_0_0 и fb24m_0_1 и добавить им реплики. Внутри них вы также можете добавлять ответы, команды и даже выборы. В примере, при нажатии на Согласиться, активируется диалог fb24m_0_0, а при нажатии на Отказаться - fb24m_0_1."
	}
]}